xmlfiles/request1.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/">
   <soap:Header/>
   <soap:Body>
      <tem:Add>
         <tem:a>param_1</tem:a>
         <tem:b>param_2</tem:b>
      </tem:Add>
   </soap:Body>
</soap:Envelope>