RESTAssuredAutomation/SoapRequrest/Add.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
    <Body>
        <Add xmlns="http://tempuri.org/">
            <a>2</a>
            <b>2</b>
        </Add>
    </Body>
</Envelope>